/* 1118. 一月有多少天
指定年份 Y 和月份 M，请你帮忙计算出该月一共有多少天。

示例 1：
输入：Y = 1992, M = 7
输出：31

示例 2：
输入：Y = 2000, M = 2
输出：29

示例 3：
输入：Y = 1900, M = 2
输出：28
*/

/* 闰年：
年份不是100的倍数，而且4的倍数
年份是400的倍数
*/

class Solution {
public:
  int numberOfDays(int Y, int M) {
    unordered_map<int, int> num_days = {
      {1, 31}, {2, 28}, {3, 31}, {4, 30}, 
      {5, 31}, {6, 30}, {7, 31}, {8, 31}, 
      {9, 30}, {10, 31}, {11, 30}, {12, 31}
    };
    int days = num_days[M];
  
    if ((Y % 100 != 0 && Y % 4 == 0) ||
        (Y % 400 == 0)) {
      if (M == 2) {
        return days + 1;
      }
    } 
    return days;
  }
};
